[{
    "name" : "Captain America",
    "real_name" : "Steve Rogers",
    "img" : "/characters/ca.jpg",
    "description" : "Captain America is a symbol of patriotism and heroism in the Marvel Universe. He is a super-soldier who fought in World War II and continues to defend freedom and justice in the modern world. Steve Rogers is known for his unwavering courage, leadership skills, and sense of duty.",
    "trivia" : "In the Marvel Cinematic Universe, Captain America's shield is made of vibranium, a rare and nearly indestructible metal. It was given to him by Howard Stark, Tony Stark's father, during World War II.",
    "powers" : "Enhanced strength, speed, agility, and durability due to the Super-Soldier Serum. He is also an expert tactician and skilled hand-to-hand combatant.",
},

{
    "name": "Iron Man",
    "real_name": "Tony Stark",
    "img" : "/characters/ca.jpg",
    "description": "Tony Stark, also known as Iron Man, is a genius billionaire inventor, industrialist, and playboy. After being kidnapped and building a powered suit of armor to escape, he becomes a superhero. Using his intellect and technology, Iron Man fights crime and global threats.",
    "trivia": "Tony Stark's character was inspired by the Howard Hughes archetype. His first suit, the Mark I armor, was built with spare parts in a cave while he was held captive by terrorists.",
    "powers": "Iron Man's suit grants him superhuman strength, flight, enhanced durability, and an array of weapons and gadgets."
},

{
    "name": "Black Widow",
    "real_name": "Natasha Romanoff",
    "img" : "/characters/ca.jpg",
    "description": "Natasha Romanoff, also known as Black Widow, is a highly trained spy, assassin, and former agent of S.H.I.E.L.D. She is skilled in hand-to-hand combat, espionage, and marksmanship. Black Widow is a key member of the Avengers, using her expertise to fight against threats to humanity.",
    "trivia": "Black Widow was trained in the Red Room, a secretive Soviet program that molded young girls into skilled operatives. She defected to S.H.I.E.L.D. and later joined the Avengers.",
    "powers": "Black Widow possesses exceptional fighting skills, agility, and reflexes. She also utilizes various gadgets and weapons."
},

{
    "name": "Hulk",
    "real_name": "Bruce Banner",
    "img" : "/characters/ca.jpg",
    "description": "Bruce Banner, also known as the Hulk, is a brilliant scientist who, after being exposed to gamma radiation, transforms into a raging green behemoth when angered. The Hulk possesses immense strength and near-invulnerability, making him one of the most powerful beings in the Marvel Universe.",
    "trivia": "The Hulk's alter ego, Bruce Banner, is constantly struggling to control his anger and prevent the Hulk from causing destruction. The character's catchphrase is 'Hulk smash!'",
    "powers": "The Hulk possesses superhuman strength, durability, and regeneration. His strength increases with his anger, and he can leap great distances."
},

{
    "name": "Spider-Man",
    "real_name": "Peter Parker",
    "img" : "/characters/ca.jpg",
    "description": "Peter Parker, also known as Spider-Man, is a high school student who gains spider-like abilities after being bitten by a radioactive spider. He uses his powers to fight crime and protect New York City as the friendly neighborhood superhero, Spider-Man.",
    "trivia": "Spider-Man's motto is 'With great power comes great responsibility,' a lesson he learned from his Uncle Ben. He is known for his witty banter and acrobatic fighting style.",
    "powers": "Spider-Man has superhuman strength, agility, and reflexes. He can cling to walls, has a 'spider-sense' that warns him of danger, and uses web-shooters to swing between buildings."
},

{
    "name": "Thor",
    "real_name": "Thor Odinson",
    "img" : "/characters/ca.jpg",
    "description": "Thor Odinson is the Norse God of Thunder and a member of the Asgardian royal family. He wields the enchanted hammer Mjolnir and possesses the power of lightning. Thor is a mighty warrior and a founding member of the Avengers, dedicated to defending the Nine Realms from threats.",
    "trivia": "In Norse mythology, Thor is the son of Odin, the Allfather, and is associated with thunder, lightning, and storms. He is depicted as a fierce warrior with a magical hammer.",
    "powers": "Thor possesses superhuman strength, speed, and durability. He can manipulate weather, summon lightning, and is nearly invulnerable. He is also proficient in hand-to-hand combat and is a skilled warrior."
},

{
    "name": "Black Panther",
    "real_name": "T'Challa",
    "img" : "/characters/ca.jpg",
    "description": "T'Challa, also known as Black Panther, is the king of the African nation of Wakanda. He is a skilled warrior and possesses enhanced strength, speed, and agility due to ingesting the heart-shaped herb. Black Panther is also a genius inventor and strategist, leading Wakanda into a technologically advanced society.",
    "trivia": "Wakanda is the only known source of vibranium, a valuable and nearly indestructible metal. Black Panther's suit is made of vibranium, providing him with enhanced protection and offensive capabilities.",
    "powers": "Black Panther possesses enhanced strength, speed, agility, and senses. He is also a master martial artist and tactician."
},

{
    "name": "Doctor Strange",
    "real_name": "Stephen Strange",
    "img" : "/characters/ca.jpg",
    "description": "Stephen Strange, a former neurosurgeon, becomes the Sorcerer Supreme known as Doctor Strange after a car accident leaves his hands injured. Seeking a cure, he discovers the mystic arts under the guidance of the Ancient One. Doctor Strange protects Earth from magical and mystical threats, using spells and artifacts to defend reality.",
    "trivia": "Doctor Strange is known for his distinctive hand gestures and spells, often accompanied by mystical symbols. He wields the Eye of Agamotto, a powerful artifact capable of manipulating time and revealing truth.",
    "powers": "Doctor Strange possesses mastery over the mystic arts, allowing him to cast spells, create illusions, teleport, and manipulate reality."
},

{
    "name": "Star-Lord",
    "real_name": "Peter Quill",
    "img" : "/characters/ca.jpg",
    "description": "Peter Quill, also known as Star-Lord, is the leader of the Guardians of the Galaxy. He is a charismatic and resourceful space adventurer who wields advanced technology and is skilled in combat and piloting. Star-Lord is known for his sense of humor and roguish charm.",
    "trivia": "Star-Lord is half-human and half-Celestial, granting him enhanced abilities and a connection to the cosmos. He inherited his title of Star-Lord from his father, Ego the Living Planet.",
    "powers": "Star-Lord is a skilled marksman and hand-to-hand combatant. He also possesses enhanced strength, agility, and durability."
},

{
    "name": "Gamora",
    "real_name": "Gamora",
    "img" : "/characters/ca.jpg",
    "description": "Gamora is a former assassin and member of the Guardians of the Galaxy. She is the adopted daughter of the intergalactic warlord Thanos and was raised to be a deadly warrior. Gamora seeks redemption for her past actions and fights alongside the Guardians to protect the galaxy.",
    "trivia": "Gamora is known as the deadliest woman in the galaxy. She was once known as the favorite daughter of Thanos but later rebelled against him.",
    "powers": "Gamora is a highly skilled martial artist and assassin. She possesses enhanced strength, agility, and durability, as well as expert training in various weapons."
},

{
    "name": "Drax the Destroyer",
    "real_name": "Drax",
    "img" : "/characters/ca.jpg",
    "description": "Drax the Destroyer is a member of the Guardians of the Galaxy. He is a vengeful warrior seeking to avenge the death of his family at the hands of the intergalactic villain, Thanos. Drax possesses superhuman strength and durability, making him a formidable ally in battle.",
    "trivia": "In the Marvel Comics, Drax's real name is Arthur Douglas. After his family was killed by Thanos, he was resurrected as Drax the Destroyer with the sole purpose of killing Thanos.",
    "powers": "Drax possesses superhuman strength, durability, and reflexes. He is also an expert hand-to-hand combatant and is skilled in using various weapons."
},

{
    "name": "Rocket Raccoon",
    "real_name": "Rocket",
    "img" : "/characters/ca.jpg",
    "description": "Rocket Raccoon is a member of the Guardians of the Galaxy. He is a genetically engineered raccoon with a talent for engineering, piloting, and weapons. Rocket is known for his sarcastic wit and love of explosives, often serving as the team's mechanic and tactician.",
    "trivia": "Rocket Raccoon was experimented on and genetically modified, enhancing his intelligence and physical abilities. He has a close bond with his partner, Groot.",
    "powers": "Rocket Raccoon is a skilled marksman, pilot, and engineer. He is highly intelligent and resourceful, often crafting improvised weapons and gadgets from scrap."
},

{
    "name": "Groot",
    "real_name": "Groot",
    "img" : "/characters/ca.jpg",
    "description": "Groot is a member of the Guardians of the Galaxy. He is a sentient tree-like creature from the planet X, with the ability to regenerate and manipulate his body. Groot is known for his limited vocabulary, consisting mostly of the phrase 'I am Groot,' and his unwavering loyalty to his friends.",
    "trivia": "Groot is capable of regenerating from even the smallest twig and can rapidly grow into a giant form if needed. Despite his limited vocabulary, he is highly intelligent and compassionate.",
    "powers": "Groot possesses the ability to regenerate and manipulate plant matter. He can grow his body to immense sizes and is incredibly strong and durable."
}]